[{"name":"Gutenverse Form","slug":"gutenverse-form","host":"wporg","incoming":"0","description":"Streamline the process of creating and managing forms on your WordPress website with our powerful and intuitive form builder plugin.\nWith more than 10 easy-to-use blocks, you can create your own customized forms effortlessly.\nFEATURES\nUnlock an enhanced Gutenberg\/Block Editor experience with these amazing features:\n10+ CUSTOMIZABLE GUTENBERG FORM BLOCKS\nChoose from a wide range of fully customizable form blocks that offer advanced and flexible options, enhancing your WordPress block editor experience.\nLIGHTWEIGHT &amp; FAST USER EXPERIENCE\nExperience the best performance with Gutenverse Form. Our streamlined code ensures optimal usage of the WordPress block editor, making your website lighter and faster for an improved user experience.\nAMAZING PAIR WITH BLOCK THEMES\nLeverage WordPress&#8217;s latest Site Editing feature and unlock endless possibilities for customizing form templates using only Gutenberg blocks. Gutenverse Form&#8217;s blocks will assist you in building your ideal form templates.\nLIVE RESPONSIVE EDITING\nOur deep integration with responsive editing allows you to perfect your website&#8217;s appearance on every device.\nGUTENBERG BLOCKS\nPurpose-built blocks designed for your forms. Add, rearrange, and style them to create the perfect form for your site.\nGENERAL BLOCKS\n\nSection. Add a section to wrap several blocks within columns.\nColumn. Resizable column to hold your block elements, with draggable resize control that make it convenient to use.\n\nFORM BLOCKS\n\nForm Builder: A versatile wrapper for building flexible forms with a wide array of field choices.\nCheckbox: Create multiple checkable selections with checkboxes.\nDate: Capture date information with a convenient date picker interface.\nEmail: Gather email information and validate its format to ensure valid submissions.\nSelect: Provide a predefined list of choices for users to select from (single option).\nMulti-select: Offer a predefined list of choices for users to select from (multiple options).\nNumber: Capture numeric information and validate it to ensure accurate submissions.\nRadio: Present predefined radio options for users to choose from.\nSwitch: Toggle control with binary options, perfect for binary questions.\nTelp: Collect phone number information and validate its format for accuracy.\nText: Gather string information (excluding &#8220;Return&#8221; character).\nText Area: Obtain long strings of text, including the &#8220;Return&#8221; character.\n\nCOMMUNITY\nJoin our communities and share your experiences with us.\nOUR COMMUNITIES\n\nJoin the Facebook Group!\nFollow us on Twitter! \nFollow us on Instagram!\nCheck our TikTok!","version":"0.5.1","url":"","icon":false,"icons":"https:\/\/ps.w.org\/gutenverse-form\/assets\/icon.svg?rev=2976212"},{"name":"Gutenverse","slug":"gutenverse","host":"wporg","incoming":"0","description":"Powerful and lightweight Gutenberg blocks and page builder plugin for WordPress FSE\/Full Site Editor. Start customizing your website with 45+ easy-to-use blocks (including Form, Popup, Gallery, etc) and prebuild templates library available, transform your dream website into reality with ease and with light and high-performance results!.\nGutenverse will makes your experience using Gutenberg much more convenient.\nCheck out our Gutenberg Blocks in Action\nFully compatible with the latest WordPress’s Full-site Editor and Gutenberg. With Gutenverse you can utilize WordPress’s Full-site Editor and Block Patterns toward it&#8217;s full potential and improved publishing experience with advanced and vast options available that contains diverse kind of blocks to cover all of your needs. Also, We’ve created a beautiful WordPress theme to help you get started with Gutenverse.\nCheck Gutenverse Pre-Built Template Websites.\nFEATURES\nHere are some amazing features to enhance your Gutenberg \/ block editor experience :\n45+ EASY TO USE GUTENBERG BLOCKS\nIncludes more than 45+ fully customizable blocks and each block is built with advanced and flexible options to enhance your WordPress block editor experience. Start creating content with endless possibilities.\nTEMPLATE LIBRARY\nChoose from various options of layout and section which suit your needs. You can also directly install the theme templates from the library.\nLIGHTWEIGHT &amp; FAST USER EXPERIENCE\nGutenverse make the most effective code flow, so it could bring the best experience while using WordPress block editor and also make your website lighter &amp; faster for a better experience for your users.\nAMAZING PAIR WITH BLOCK THEMES\nAlongside WordPress’s latest Site Editing feature, Gutenverse gives you even more possibilities to create and customize templates and build your website fully only using Gutenberg blocks. Gutenverse will assist you with all of it’s blocks to build your templates.\nIMPROVED PUBLISHING EXPERIENCE\nWith improved WordPress Gutenberg block editor experience, Gutenverse has live responsive editing. Provides you with a section block where each of the blocks has highly customizable looks to best fit your site appearance.\nLIVE RESPONSIVE EDITING\nLimitless creativity in Gutenverse , with deep integration on responsive editing, You can build your website perfectly on every device.\nGLOBAL COLOR &amp; FONT VARIABLE\nControl all Color and typography aspects of all Gutenverse elements with ease and convenience especially by utilizing the Gutenverse Global Style extended.\nADVANCED ICON SELECTOR\nFind the most appropriate icon for your website, with our advance icon selector you can easily choose which icon to use.\nBLOCKS MANAGEMENT\nEnable\/disable blocks to make your editing experience more smooth.\nRESPONSIVE BREAKPOINTS\nYou can edit the breakpoints for tablet and mobile devices.\nGUTENBERG BLOCKS\nThe block Gutenverse provide is grouped as the following:\nGeneral Blocks. Get blocks with functionalities you need. Each is designed to serve a specific function. Mix &amp; match them to best serve your site.\nForm Blocks. Blocks that are made for your built-in forms. Add, rearrange, and style them to create a form best for your site\nPost Blocks. Blocks that are designed to create post templates. Highly customizable blocks to create elaborate post templates.\nGENERAL BLOCKS\n\nSection. Add a section to wrap several blocks within columns.\nColumn. Resizable column to hold your block elements, with draggable resize control that make it convenient to use.\nAccordions. A vertically stacked list of expandable\/collapsable item.\nAdvanced Heading. A more Advanced Heading with multiple options.\nAnimated Text. Create text with beautiful animation flow.\nButton. Add beautiful and interactive action button.\nMulti Buttons. Create multiple buttons easier.\nDivider. Split your content with a customizable divider.\nFun Facts. Create an interesting fact about your website or something you achieved.\nGallery. Showcase your images in grid or masonry layout, with a popup and zoom option.\nGoogle Maps. Display a location you want to share to your website visitor.\nHeading. Create Title\/Heading on your page.\nIcon. Add a beautiful icon with more than 100 icon options.\nIcon Box. Add an information section with icon box.\nIcon List. Create a list with icons.\nImage. Showcase your image.\nImage Box. Add an information section with image box.\nLogo Slider. Showcase your clients, sponsors, or a list of images on your website.\nNav Menu. Create a navigation menu for your visitor to explore your website.\nProgress Bar. Create a progress bar of your achivement or other things you want to share.\nSocial Icons. Show social networks link to your website visitors.\nSocial Share. Allow your visitor to share the current page.\nSpacer. Create a spacer to give a gap between content.\nStar Rating. Showcase ratings of anything you want to share.\nTabs. Create content inside a tab block.\nTeam. Show your team details.\nTestimonials. Showcase your client&#8217;s or people&#8217;s testimonals.\nText Editor. A place to create a text content.\nVideo. Embed a video you want to share.\nPopup Builder. Create an interactive popup you want to show to your user.\n\nFORM BLOCKS\n\nForm Builder. A wrapper to build a flexible form with many field choices.\nCheckbox. Multiple check and uncheckable checkboxes.\nDate. Date block to get date information with convenient date picker interface.\nEmail. Get email information. It ensures that the email submitted is a valid email by providing feedback.\nSelect. Serve a predefined list of choices to choose from. May only select one option\nMulti-select. Serve a predefined list of choices to choose from. May select multiple options.\nNumber. Get numeric information. It ensures the information submitted is a valid number by providing feedback.\nRadio. Serve predefined radio options to choose from.\nSwitch. Toggle control with binary option. Usually used for the binary question\nTelp. Get phone number information and ensure it is valid phone information by providing feedback.\nText. Get string information. May not get the “Return” character.\nText Area. Get string information. Useful to get long strings and may obtain “Return” character.\n\nPOST BLOCKS\n\nPost Author. Show post author name.\nPost Blocks. Showcase a block of posts of your choice.\nPost Comment. Show comment section of a single post.\nPost Content. Show the content of your post.\nPost Date. Show the published\/modified date of a single post.\nPost Excerpt. Show the short summary of a single post.\nPost Featured Image. Show the featured image of a single post.\nPost List. Show a list of posts of your choice.\nPost Terms. Show the categories\/tags of a single post.\nPost Title. Show the title of a single post.\n\nTEMPLATE LIBRARY\nCheck our pre build collections\nTEMPLATE COLLECTION\n\nLayout, you can import layout to be used in your pages or you can also directly install the theme package.\nSection, you can import section to mix and match with your current page or template&#8217;s content.\nFavorites, tired of scrolling and searching the same layouts or sections? now you can set it to favorites, so next time it&#8217;s easier for you find it.\n\nCOMMUNITY\nJoin now and share your Gutenberg experience with us.\nOUR COMMUNITIES\n\nFacebook : Join Here! \nTwitter : Join Here! \nInstagram : Join Here!\nTikTok : Join Here!","version":"1.9.2","url":"","icon":false,"icons":"https:\/\/ps.w.org\/gutenverse\/assets\/icon-256x256.gif?rev=2841417"}]